# Yrock 8

x = 123454321
x = str(x)
print("Конвертация в строку", x)
print("Повторение строки", x * 10)
print("Сровнение строк abc > x", "abc" > "x")
print("Сровнение строк a > b", "a" > "b")
print("Сровнение строк a > B", "a" > "B")
print("Код символа a", ord("a"))
print("Поиск позиции символа в строке", x.find("4"))
print("Точный поиск позиции символа в строке", x.index("4"))
print("Поиск позиции символа в строке с конца", x.rfind("4"))
print("Поиск позиции символа в строке от 4 символа до 6 - ", x.find("4", 4, 6))
print("")

print("Замена символа", x.replace("4", "ж"))
print("Замена символа", x.replace("5", ""))
print("Замена символа несколько раз", x.replace("3", "32123", 1))
print("")

x = "АБВЯУ абвяу"
print("В заглавные", x.upper())
print("В пропесные", x.lower())
print("C заглавной буквы", x.title())
input()